modules/admin/controllers/DefaultController.php

    public function actionIndex() {
        $id = Yii::$app->user->id;
        $user=user::find()->asArray()->where(['id'=>$id])->one();
---
SELECT * FROM `user` WHERE `id`=3