models/Login.php

SELECT * FROM `user` WHERE `email`='admin@admin.ru'
---
    public function getUser()
    {
        return User::findOne(['email'=>$this->email]); // а получаем мы его по введенному имейлу